InformationRegisters/ДатыВыгрузкиОбъектовНаСервер.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<InformationRegister>
		<Properties>
			<Name>ДатыВыгрузкиОбъектовНаСервер</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаВыгрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Заказ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ДатыВыгрузкиОбъектовНаСервер/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Устанавливает дату выгрузки объекта для отправки на сервер.
//
// Параметры:
//  Объект - СправочникСсылка, ДокументСсылка - Ссылка на обрабатываемый объект.
//
Процедура УстановитьДатуВыгрузки(Объект) Экспорт

	МенеджерЗаписи = РегистрыСведений.ДатыВыгрузкиОбъектовНаСервер.СоздатьМенеджерЗаписи();

	МенеджерЗаписи.Объект       = Объект;
	МенеджерЗаписи.ДатаВыгрузки = ТекущаяДата();

	МенеджерЗаписи.Записать();

КонецПроцедуры

// Проверяет, выгружался ли объект для отправки на сервер.
//
// Параметры:
//  Объект - СправочникСсылка, ДокументСсылка - Ссылка на обрабатываемый объект.
// 
// Возвращаемое значение:
//  Истина - Если объект выгружался на сервер.
//
Функция ОбъектВыгружалсяНаСервер(Объект) Экспорт

	МенеджерЗаписи = РегистрыСведений.ДатыВыгрузкиОбъектовНаСервер.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Объект = Объект;
	МенеджерЗаписи.Прочитать();

	Возврат МенеджерЗаписи.Выбран();

КонецФункции

#КонецОбласти

#КонецЕсли
